# SQL code

In [1]:
import pandas as pd

In [2]:
import sqlite3

## Connect to db (create new if it does not exits)

In [3]:
con = sqlite3.connect('Family.db')

In [4]:
cur = con.cursor()

### Create table

In [5]:
cur.execute ("create table if not exists people (name text, surname text, year integer)")

### Add lines to table

In [6]:
cur.execute ("insert into people values ('Ricardo', 'Naka', 1967)")
cur.execute ("insert into people values ('Erica', 'Taira', 1975)")
cur.execute ("insert into people values ('Carolina', 'Naka', 2003)")
cur.execute ("insert into people values ('Guilherme', 'Naka', 2005)")
cur.execute ("insert into people values ('Isabela', 'Ramos', 2003)")

In [7]:
con.commit()

### selecting data from table

In [8]:
con = sqlite3.connect('Family.db')
cur = con.cursor()

In [24]:
frame = pd.read_sql("Select * from people where surname='Naka' or year > 2000", con=con)
con.close()

In [25]:
type(frame)

pandas.core.frame.DataFrame

In [26]:
frame

        name surname  year
0    Ricardo    Naka  1967
1   Carolina    Naka  2003
2  Guilherme    Naka  2005
3    Isabela   Ramos  2003